Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/state_examinations/examination_fees.html.txt.tmx
Source language: en
Languages: ga

source: Leaving Certificate examination fees
ga: Táillí scrúdaithe na hArdteistiméireachta

source: • Where to apply Information
ga: • Cá háit a ndéanfaidh mé iarratas

source: If you are taking the Leaving Certificate in a school setting, your school will give you a form
ga: Ní mór do dhaltaí atá ag déanamh nó ag athdhéanamh na hArdteistiméireachta táillí a íoc le go bhféadfaidís na scrúduithe a dhéanamh

source: You make the payment through a bank and the bank must stamp the form. You then return the form to the school
ga: Má tá cárta leighis agat féin nó ag do thuismitheoir nó do chaomhnóir, tá tú díolmhaithe ó na táillí sin

source: If you, your parent(s) or guardian(s) hold a current medical card you do not have to pay the fee
ga: Ní gá do dhalta a bhfuil cárta leighis reatha ag a thuismitheoir nó ag a chaomhnóir an táille a íoc

source: Put the details of the medical card on the fee payment form and return the form to the school
ga: Sa chás seo, cuirtear sonraí an chárta leighis ar an bhfoirm íocaíochta táille, agus is ansin a sheolann an tuismitheoir an fhoirm ar ais chuig an scoil

source: If you are an external student (that is, you are sitting your examinations outside of a school setting), you can either apply and pay online or get a form from the Entries section of the State Examinations Commission (see 'Where to apply') and pay through a bank
ga: Más dalta seachtrach tú (is é sin, nach bhfuil tú ag déanamh do chuid scrúduithe laistigh de scoil éigin), is féidir leat iarratas agus íocaíocht ar líne a dhéanamh nó dul i dteagmháil le Rannóg Iontrálacha Choimisiún na Scrúduithe Stáit

source: For external students the fee is due to be paid by 8 February 2017
ga: Ní mór an táille don bhliain 2017 a bheith íoctha ar nó roimh 8 Feabhra 2017

source: If you have not paid your exam fees on time, you can still pay but you will be charged an extra fee per subject (currently €32 per subject for applications received between 9 February and 28 February 2017 inclusive)
ga: Mura raibh do tháillí scrúduithe íoctha in am agat, b'fhéidir leat iad a íoc tar éis 8 Feabhra, ach bheadh táille bhreise le híoc ar gach ábhar agat (faoi láthair €32 ar gach ábhar i gcomhair iarratais faighte idir 9 Feabhra agus 28 Feabhra 2017, araon san áireamh)

source: A second late fee of €52 per subject in addition to the normal fee will apply to applications made from 1 March to 29 April 2017
ga: Ní ghlactar iarratais ó 1 Márta 2017 ach amháin in imthosca eisceachtúla

source: Entries for subjects with a practical, oral or project component will not be accepted at this stage
ga: Tá dara táille dhéanach de €52 ar gach ábhar de bhreis ar an gnáththáille le híoc

source: External candidates who hold a current medical card do not have to pay the fee but are still liable for late fees if they apply after the deadline
ga: Ní gá do dhalta seachtrach a bhfuil cárta leighis reatha aige/aici an táille a íoc. Sa chás go bhfuil díolúine agat ó tháillí, tá táillí deireanacha fós le híoc agat má dhéanann tú d'iarratas tar éis an spriocdháta

source: School-based students sitting the Leaving Certificate examination for the first time in 2017 must pay a fee of €116
ga: Ní mór do dhaltaí atá ag freastal ar scoil éigin agus atá ag déanamh scrúduithe Ardteistiméireachta den chéad uair i 2017 táille de €116 a íoc

source: External candidates sitting the exam for the first time pay a fee of €71 for one or two subjects and €116 for 3 or more subjects
ga: Íocann iarrthóirí seachtracha atá ag déanamh an scrúdaithe den chéad uair táille de €71 i gcomhair ábhar amháin nó dhá ábhar agus €116 i gcomhair trí ábhar nó níos mó

source: If your parents or guardian hold a current medical card, you do not have to pay the fee
ga: Má tá cárta leighis reatha ag do thuismitheoirí nó do chaomhnóir, ní gá duit an táille a íoc

source: External candidates repeating the Leaving Certificate in 2017 pay fees on a sliding scale as follows: No. of Subjects Fees per subject 1 subject €116 2 subjects €211 3 or more €326
ga: Ní mór do dhaltaí atá ag freastal ar scoil agus atá ag athdhéanamh na hArdteistiméireachta táille de €301 a íoc
